/* thrive.h - v0.2 - public domain data structures - nickscha 2026

A C89 standard compliant, nostdlib (no C Standard Library)
Low Level Programming Language inbetween Assembly and C (THRIVE).

LANGUAGE SPECIFICATON (WIP)

  General Design (less than C89):
    - procedural
    - no mixed declaration
    - fixed sized types  ; on all platforms
    - no header files    ; just thrive source files
    - no marcos/typedefs
    - no standard library
    - no recursive functions
    - all loop conditions must have a max bound

  Types:
    - s8, s16, s32      ; String type
    - b8, b16, b32, b64 ; Boolean type
    - u8, u16, u32, u64 ; Unsigned Integer type
    - i8, i16, i32, i64 ; Signed Integer type
    - f8, f16, f32, f64 ; Floating type

  Keywords:
    - ret ; Return
    - ext ; External Function
    - if/else
    - for
    - break
    - continue

SYNTAX (WIP)

  u32 a = 10
  u32 b = 0
  u32 i

  if (a > 5)
    a = 5
    b = 1
  else
    a = 3

  ; for loop example
  for (i = 0 : i < 10 : ++i)
    a += 1
    b += 1

    if (a > 7)
      break

  ; function declaration
  u32 sum(u32 a : u32 b)
    u32 result
    result = a + b
    ret result

  ; function call
  u32 res = sum(a : b)

LICENSE

  Placed in the public domain and also MIT licensed.
  See end of file for detailed license information.

*/
#ifndef THRIVE_H
#define THRIVE_H

/* #############################################################################
 * # [SECTION] COMPILER SETTINGS
 * #############################################################################
 */
/* Check if using C99 or later (inline is supported) */
#if __STDC_VERSION__ >= 199901L
#define THRIVE_INLINE inline
#elif defined(__GNUC__) || defined(__clang__)
#define THRIVE_INLINE __inline__
#elif defined(_MSC_VER)
#define THRIVE_INLINE __inline
#else
#define THRIVE_INLINE
#endif

#define THRIVE_API static

typedef char s8;
typedef unsigned char u8;
typedef unsigned short u16;
typedef unsigned int u32;
typedef int i32;
typedef float f32;
typedef double f64;

#define THRIVE_STATIC_ASSERT(c, m) typedef char thrive_assert_##m[(c) ? 1 : -1]

THRIVE_STATIC_ASSERT(sizeof(s8) == 1, s8_size_must_be_1);
THRIVE_STATIC_ASSERT(sizeof(u8) == 1, u8_size_must_be_1);
THRIVE_STATIC_ASSERT(sizeof(u16) == 2, u16_size_must_be_2);
THRIVE_STATIC_ASSERT(sizeof(u32) == 4, u32_size_must_be_4);
THRIVE_STATIC_ASSERT(sizeof(i32) == 4, i32_size_must_be_4);
THRIVE_STATIC_ASSERT(sizeof(f32) == 4, f32_size_must_be_4);
THRIVE_STATIC_ASSERT(sizeof(f64) == 8, f64_size_must_be_8);

#undef THRIVE_STATIC_ASSERT

/* #############################################################################
 * # [SECTION] Structs
 * #############################################################################
 */
typedef enum thrive_status_type
{
    THRIVE_STATUS_OK = 0,
    THRIVE_STATUS_ERROR_ARGUMENTS,
    THRIVE_STATUS_ERROR_SYNTAX,
    THRIVE_STATUS_ERROR_MEMORY

} thrive_status_type;

typedef struct thrive_status
{
    thrive_status_type type;

    s8 *message;

    s8 *token_start;
    s8 *token_end;

    u32 line;
    u32 column;

    s8 *line_start;

} thrive_status;

typedef enum thrive_token_kind
{
    THRIVE_TOKEN_KIND_EOF = 0,
    THRIVE_TOKEN_KIND_NEW_LINE,
    THRIVE_TOKEN_KIND_LPAREN,      /* ( */
    THRIVE_TOKEN_KIND_RPAREN,      /* ) */
    THRIVE_TOKEN_KIND_LBRACE,      /* { */
    THRIVE_TOKEN_KIND_RBRACE,      /* } */
    THRIVE_TOKEN_KIND_LBRACKET,    /* [ */
